#  Note 1
# What is Pandas
### What is Pandas? Pandas is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data. The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

# The Python list can be either homogeneous or heterogeneous. Homogeneous means that it only contains a single type of data. A heterogeneous structure on the other hand, involves different file types being concatenated in the list


# Python Pandas Series
### The Pandas Series can be defined as a one-dimensional array that is capable of storing various data types. We can easily convert the list, tuple, and dictionary into series using "series' method. The row labels of series are called the index. A Series cannot contain multiple columns. It has the following parameter:

### data: It can be any list, dictionary, or scalar value.
### index: The value of the index should be unique and hashable. It must be of the same length as data. If we do not pass any index, default np.arrange(n) will be used.
### dtype: It refers to the data type of series.
### copy: It is used for copying the data.
# Creating a Series:
### We can create a Series in two ways:
### Create an empty Series
### Create a Series using inputs

In [1]:
import pandas as pd

In [2]:
#Two types of datastructures in pandas=
# Series - A series of data (1 dimensional)
# DataFrames - Tabular data (2 dimensional)
# Panel 3d

In [3]:
marks = pd.Series([10,20,30])# 0,1,2 the value are on these indexing 
marks

0    10
1    20
2    30
dtype: int64

In [4]:
#for find particular value throught indexing
marks[2]

30

In [5]:
marks[1]

20

# Note 2
### specifying custom indexes we can;t change index datatype
### [ ] ----> Indexing
### () ---> funtial ki list ka lea use hotya ha

In [6]:
age =pd.Series([45,23,23,32],index = ['Ali','Ahmed','Razque','Ahmed'],dtype='float')
age

Ali       45.0
Ahmed     23.0
Razque    23.0
Ahmed     32.0
dtype: float64

In [8]:
age['Ali']='Sami'
age

Ali       Sami
Ahmed     23.0
Razque    23.0
Ahmed     32.0
dtype: object

In [9]:
age['Sami']='AS'

In [10]:
age

Ali       Sami
Ahmed     23.0
Razque    23.0
Ahmed     32.0
Sami        AS
dtype: object

In [11]:
age['Ali']=43
age

Ali         43
Ahmed     23.0
Razque    23.0
Ahmed     32.0
Sami        AS
dtype: object

In [12]:
import pandas as pd
age1 =pd.Series([45,56,76,78,89],index = ['Ali','Ahmed','Razque','Ahmed','Sami'],dtype='float')
age1

Ali       45.0
Ahmed     56.0
Razque    76.0
Ahmed     78.0
Sami      89.0
dtype: float64

In [13]:
age1[age1>70]
#filtering data in a series

Razque    76.0
Ahmed     78.0
Sami      89.0
dtype: float64

In [14]:
age1[age1>=78]#filtering data in a series

Ahmed    78.0
Sami     89.0
dtype: float64

In [15]:
age1[['Sami','Ahmed','Ali']] # Fancy index

Sami     89.0
Ahmed    56.0
Ahmed    78.0
Ali      45.0
dtype: float64

In [16]:
# Creating series for dictornary 
info = pd.Series({
    'ali' : 34,
    'lucky' : 34,
    'nawaz' : 23
    
})
info

ali      34
lucky    34
nawaz    23
dtype: int64

In [17]:
import pandas as pd
age = pd.Series({
    'ahmed'   : 34,
    'ALi'   : 12,
    'Sabir'   : 34,
    'Sami'   : None
})
age

ahmed    34.0
ALi      12.0
Sabir    34.0
Sami      NaN
dtype: float64

In [18]:
age['ahmed']

34.0

In [19]:
pd.isnull(age)

ahmed    False
ALi      False
Sabir    False
Sami      True
dtype: bool

In [20]:
pd.notnull(age)

ahmed     True
ALi       True
Sabir     True
Sami     False
dtype: bool

In [21]:
age.mean()

26.666666666666668

In [22]:
age =pd.Series(['sami','sajid'],index=[1,2])
age

1     sami
2    sajid
dtype: object

In [23]:
age[2]

'sajid'

In [24]:
display(age)

1     sami
2    sajid
dtype: object

In [25]:
display(age1)

Ali       45.0
Ahmed     56.0
Razque    76.0
Ahmed     78.0
Sami      89.0
dtype: float64

In [26]:
a=age + age1
a

1         NaN
2         NaN
Ahmed     NaN
Ahmed     NaN
Ali       NaN
Razque    NaN
Sami      NaN
dtype: object

In [27]:
display(a)

1         NaN
2         NaN
Ahmed     NaN
Ahmed     NaN
Ali       NaN
Razque    NaN
Sami      NaN
dtype: object

# Dataframes: Tabular data
### pd.DataFrame - Create a dataframe

In [28]:
student = pd.DataFrame({
    'name' : ['sami','kashi','ahmend'],
    'age'  : [ 32,43,34],
    'gpa'  : [2.23,3.23,3.34],
    'address':['Karachi','Larkana','Kamber']
})
student
#Keys will be columns

     name  age   gpa  address
0    sami   32  2.23  Karachi
1   kashi   43  3.23  Larkana
2  ahmend   34  3.34   Kamber

In [29]:
student['caste']=['wadho','hakro','khan'] # create new column in dataframe at dictornary

In [30]:
student

     name  age   gpa  address  caste
0    sami   32  2.23  Karachi  wadho
1   kashi   43  3.23  Larkana  hakro
2  ahmend   34  3.34   Kamber   khan

In [31]:
student.columns

Index(['name', 'age', 'gpa', 'address', 'caste'], dtype='object')

In [32]:
student['name']# it show us data in series becasue we ask one value it mean it show us data in 1d look below we ask him show us two data name , caste it show us 2d which is dataframe

0      sami
1     kashi
2    ahmend
Name: name, dtype: object

In [33]:
student[['name','caste']]

     name  caste
0    sami  wadho
1   kashi  hakro
2  ahmend   khan

In [34]:
student[student['gpa']>3.00]

     name  age   gpa  address  caste
1   kashi   43  3.23  Larkana  hakro
2  ahmend   34  3.34   Kamber   khan

In [36]:
## student[student[['name'],'gpa']>3.00]

In [37]:
student.age

0    32
1    43
2    34
Name: age, dtype: int64

In [38]:
 #using numpy function to specify values and adding new column which is semester by numpy
import numpy as np 
student['semester']=np.arange(1,4)

In [39]:
student

     name  age   gpa  address  caste  semester
0    sami   32  2.23  Karachi  wadho         1
1   kashi   43  3.23  Larkana  hakro         2
2  ahmend   34  3.34   Kamber   khan         3

In [53]:
student['index']=[1,2,3]

In [56]:
student[4]=[1,2,3]

In [57]:
# now rename the index like here we take the student data it has 3 data
# therefore
new_index=['S1','S2','S3']
student.index = new_index

In [58]:
student

      name  age   gpa  address  caste  semester  index  4
S1    sami   32  2.23  Karachi  wadho         1      1  1
S2   kashi   43  3.23  Larkana  hakro         2      2  2
S3  ahmend   34  3.34   Kamber   khan         3      3  3

In [59]:
# in up work we did the rename the index which is already created 
# now we are going to give index we we create the record

doctors = pd.DataFrame({
    'names':['Asad','Rahim'],
    'qualification':['PhD','MS']
},index=['d1','d2'])

doctors

    names qualification
d1   Asad           PhD
d2  Rahim            MS

In [60]:
doctors['address']=['Karachi','Lohare']
doctors

    names qualification  address
d1   Asad           PhD  Karachi
d2  Rahim            MS   Lohare

In [61]:
doctors.loc['d1'] #Accessing row-wise data using index
#loc and iloc

names               Asad
qualification        PhD
address          Karachi
Name: d1, dtype: object

In [62]:
doctors.iloc[0] #Accessing row-wise data using index location

names               Asad
qualification        PhD
address          Karachi
Name: d1, dtype: object

In [63]:
doctors.iloc[1]

names             Rahim
qualification        MS
address          Lohare
Name: d2, dtype: object

In [64]:
doctors

    names qualification  address
d1   Asad           PhD  Karachi
d2  Rahim            MS   Lohare

In [65]:
student

      name  age   gpa  address  caste  semester  index  4
S1    sami   32  2.23  Karachi  wadho         1      1  1
S2   kashi   43  3.23  Larkana  hakro         2      2  2
S3  ahmend   34  3.34   Kamber   khan         3      3  3

In [66]:
student

      name  age   gpa  address  caste  semester  index  4
S1    sami   32  2.23  Karachi  wadho         1      1  1
S2   kashi   43  3.23  Larkana  hakro         2      2  2
S3  ahmend   34  3.34   Kamber   khan         3      3  3

In [67]:
del student[4]
student

      name  age   gpa  address  caste  semester  index
S1    sami   32  2.23  Karachi  wadho         1      1
S2   kashi   43  3.23  Larkana  hakro         2      2
S3  ahmend   34  3.34   Kamber   khan         3      3

In [68]:
del student['index']
student

      name  age   gpa  address  caste  semester
S1    sami   32  2.23  Karachi  wadho         1
S2   kashi   43  3.23  Larkana  hakro         2
S3  ahmend   34  3.34   Kamber   khan         3

In [69]:
# agian add the column
student['index']=[0,1,2]

In [70]:
student

      name  age   gpa  address  caste  semester  index
S1    sami   32  2.23  Karachi  wadho         1      0
S2   kashi   43  3.23  Larkana  hakro         2      1
S3  ahmend   34  3.34   Kamber   khan         3      2

In [71]:
student.T

               S1       S2      S3
name         sami    kashi  ahmend
age            32       43      34
gpa          2.23     3.23    3.34
address   Karachi  Larkana  Kamber
caste       wadho    hakro    khan
semester        1        2       3
index           0        1       2

In [72]:
student.transpose()

               S1       S2      S3
name         sami    kashi  ahmend
age            32       43      34
gpa          2.23     3.23    3.34
address   Karachi  Larkana  Kamber
caste       wadho    hakro    khan
semester        1        2       3
index           0        1       2

In [73]:
student

      name  age   gpa  address  caste  semester  index
S1    sami   32  2.23  Karachi  wadho         1      0
S2   kashi   43  3.23  Larkana  hakro         2      1
S3  ahmend   34  3.34   Kamber   khan         3      2

In [74]:
student.iloc[::2] #slicing in a dataframe if we want to find even row data

      name  age   gpa  address  caste  semester  index
S1    sami   32  2.23  Karachi  wadho         1      0
S3  ahmend   34  3.34   Kamber   khan         3      2

In [75]:
student.iloc[-1]

name        ahmend
age             34
gpa           3.34
address     Kamber
caste         khan
semester         3
index            2
Name: S3, dtype: object

In [76]:
student.values

array([['sami', 32, 2.23, 'Karachi', 'wadho', 1, 0],
       ['kashi', 43, 3.23, 'Larkana', 'hakro', 2, 1],
       ['ahmend', 34, 3.34, 'Kamber', 'khan', 3, 2]], dtype=object)

In [77]:
student

      name  age   gpa  address  caste  semester  index
S1    sami   32  2.23  Karachi  wadho         1      0
S2   kashi   43  3.23  Larkana  hakro         2      1
S3  ahmend   34  3.34   Kamber   khan         3      2

In [79]:
student.drop(['S2'],axis=0) #removing specific rows from dataframe
## Drop the row with index label 0

      name  age   gpa  address  caste  semester  index
S1    sami   32  2.23  Karachi  wadho         1      0
S3  ahmend   34  3.34   Kamber   khan         3      2

# Creating dataframe with different data structures

In [85]:
arr = np.array ([['sarah',50,2.4,'karachi',1],
                 ['ali',23,3.2,'lahore',2],
                 ['sami',12,3.23,'karachi',3]
                
                ])
arr
arr.shape

(3, 5)

In [86]:
df = pd.DataFrame(arr,columns=['Name','age','gpa','address','semester'])
df

    Name age   gpa  address semester
0  sarah  50   2.4  karachi        1
1    ali  23   3.2   lahore        2
2   sami  12  3.23  karachi        3

In [87]:
lst = [
    ['Sarah', 50, 3.4, 'Karachi', 1],
       ['Ahmed', 60, 2.9, 'Lahore', 2],
       ['Ali', 70, 3.6, 'Islamabad', 3],
        ['Shoaib',37,2.9,'Pindi', 4]
]
lst

[['Sarah', 50, 3.4, 'Karachi', 1],
 ['Ahmed', 60, 2.9, 'Lahore', 2],
 ['Ali', 70, 3.6, 'Islamabad', 3],
 ['Shoaib', 37, 2.9, 'Pindi', 4]]

In [96]:
frame = pd.DataFrame(lst,columns=['Name','age','gpa','address','semester'])

In [97]:
frame

     Name  age  gpa    address  semester
0   Sarah   50  3.4    Karachi         1
1   Ahmed   60  2.9     Lahore         2
2     Ali   70  3.6  Islamabad         3
3  Shoaib   37  2.9      Pindi         4

In [99]:
frame.drop(['age','semester'],axis = 1) #drop columns axis = 1

     Name  gpa    address
0   Sarah  3.4    Karachi
1   Ahmed  2.9     Lahore
2     Ali  3.6  Islamabad
3  Shoaib  2.9      Pindi

In [100]:
frame.drop([0,1],axis=0) #row-wise

     Name  age  gpa    address  semester
2     Ali   70  3.6  Islamabad         3
3  Shoaib   37  2.9      Pindi         4

In [101]:
#Slicing in dataframe
frame.iloc[::2] #start,end,step

    Name  age  gpa    address  semester
0  Sarah   50  3.4    Karachi         1
2    Ali   70  3.6  Islamabad         3

In [103]:
frame.loc[:,'Name':'age']

     Name  age
0   Sarah   50
1   Ahmed   60
2     Ali   70
3  Shoaib   37

In [104]:
#Apply function
frame.columns = ['Name','Age','CGPA','Address','Semester']

In [105]:
# create the funtion for "apply function"
def old_young (age):
    if age >40:
        return 'old'
    else:
        return 'young'
        
# now create the new columns name "status" in frame and then use apply function 
frame['status']=frame['Age'].apply(old_young)
#give old or young value and also adding new 
# column of status
frame

     Name  Age  CGPA    Address  Semester status
0   Sarah   50   3.4    Karachi         1    old
1   Ahmed   60   2.9     Lahore         2    old
2     Ali   70   3.6  Islamabad         3    old
3  Shoaib   37   2.9      Pindi         4  young

In [106]:
frame

     Name  Age  CGPA    Address  Semester status
0   Sarah   50   3.4    Karachi         1    old
1   Ahmed   60   2.9     Lahore         2    old
2     Ali   70   3.6  Islamabad         3    old
3  Shoaib   37   2.9      Pindi         4  young

In [107]:
#we also can do same thing throught Lambda functions these are one line funtion
# we us lambda for simple use like one line 
old_young = lambda age: "Old" if age>40 else "Young"
frame['Status']=frame['Age'].apply(old_young)
frame

     Name  Age  CGPA    Address  Semester status Status
0   Sarah   50   3.4    Karachi         1    old    Old
1   Ahmed   60   2.9     Lahore         2    old    Old
2     Ali   70   3.6  Islamabad         3    old    Old
3  Shoaib   37   2.9      Pindi         4  young  Young

In [108]:
employee = pd.DataFrame(
{
    'salary':[1000,2000,3000],
    'name':['Mark','Jordan','Yuaan']
}
)

employee

   salary    name
0    1000    Mark
1    2000  Jordan
2    3000   Yuaan

In [109]:
employee['salary'].apply(lambda salary: 50 if salary<=1000 else 25)

0    50
1    25
2    25
Name: salary, dtype: int64

In [110]:
employee['Increment']=\
        employee['salary'].apply(lambda salary: 50 if salary<=1000 else 25)

employee

   salary    name  Increment
0    1000    Mark         50
1    2000  Jordan         25
2    3000   Yuaan         25

In [111]:
employee['Increment']=\
        employee['salary'].apply(lambda salary: 50 if salary<=1000 else 25)

employee

   salary    name  Increment
0    1000    Mark         50
1    2000  Jordan         25
2    3000   Yuaan         25

In [112]:
np.abs(employee['Increment'])

0    50
1    25
2    25
Name: Increment, dtype: int64

# #Apply numpy functions over dataframe

# below is Assgniment
### Try creating dataframe from different types of datastructures Slide-16
### Drop rows/columns

In [113]:
# From a List of Lists:
import pandas as pd

data = [['Alice', 25], ['Bob', 30], ['Charlie', 35]]
df = pd.DataFrame(data, columns=['Name', 'Age'])

df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [114]:
# From a Dictionary of Lists:


import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [115]:
#From a List of Dictionaries:
import pandas as pd

data = [{'Name': 'Alice', 'Age': 25}, {'Name': 'Bob', 'Age': 30}, {'Name': 'Charlie', 'Age': 35}]
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [116]:
#From a NumPy Array:


import pandas as pd
import numpy as np

data = np.array([[1, 2, 3], [4, 5, 6]])
df = pd.DataFrame(data, columns=['Column1', 'Column2', 'Column3'])
df

   Column1  Column2  Column3
0        1        2        3
1        4        5        6

In [117]:
#From a List of Tuples:
import pandas as pd

data = [('Alice', 25), ('Bob', 30), ('Charlie', 35)]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35